{
  "context": {
    "domain": "ONDC:RET12",
    "action": "on_search",
    "country": "IND",
    "city": "*",
    "core_version": "1.2.0",
    "bap_id": "buyer-app-preprod-v2.ondc.org",
    "bap_uri": "https://buyer-app-preprod-v2.ondc.org/protocol/v1",
    "transaction_id": "0b00e765-b49e-4577-9805-b8f72cf3f67f",
    "message_id": "881b64b3-3111-481a-acad-2756e8a810e7",
    "timestamp": "2024-09-02T21:31:10.000Z",
    "ttl": "PT30S",
    "bpp_id": "pre.production.artisanswizard.com",
    "bpp_uri": "https://pre.production.artisanswizard.com/ondc"
  },
  "message": {
    "catalog": {
      "bpp/providers": [
        {
          "id": "22",
          "items": [
            {
              "id": "14",
              "descriptor": {
                "name": " Boita Bandana Pattachitra Bomkai Patta Saree",
                "code": "4:5007",
                "short_desc": "Embrace traditional Odisha craftsmanship with our exquisite Boita Bandana Pattachitra Bomkai Patta Saree. Handcrafted with love, this saree showcases intricate Pattachitra artwork and unique Bomkai patterns, making it a stunning addition to your ethnic wardrobe.",
                "long_desc": "The 'Boita Bandana Pattachitra Bomkai Patta Saree' category is an exquisite collection of sarees that beautifully blend the timeless traditions of Boita Bandana, Pattachitra, and Bomkai art forms. These sarees, named after the regions they originate from, are crafted with immense precision and attention to detail, making them a perfect choice for any special occasion. The Boita Bandana design within these sarees draws inspiration from the age-old maritime tradition of Odisha. It reflects the essence of ancient sea-faring expeditions where intricately woven motifs of boats and fish symbolize good luck and prosperity. These sarees exhibit a unique fusion of vibrant hues and delicate patterns, reflecting the rich cultural heritage of the region. Pattachitra, on the other hand, is a traditional art form that originated in the state of Odisha. It involves intricate painting on cloth, depicting various mythological stories and folklore using vivid colors and fine brushwork. The Pattachitra elements incorporated into these sarees add a whimsical touch, truly creating wearable works of art. Bomkai is a traditional weaving technique that originated in the town of Sonepur in Odisha. The defining feature of a Bomkai saree is its intricately woven borders and Pallu (decorative end piece) that showcase traditional motifs such as animals, flowers, and peacocks. The combination of Bomkai weaving with the Boita Bandana and Pattachitra motifs creates a visually stunning amalgamation of textures and designs. The 'Boita Bandana Pattachitra Bomkai Patta Saree' collection offers a wide range of color options to suit every taste and preference, ranging from deep maroons, vibrant oranges, royal blues, enchanting greens, and regal purples. The soft and flowy fabric used in these sarees ensures a comfortable draping experience, enabling you to look and feel confident all day long. Whether you have a wedding, festive celebration, or any other special event on the horizon, these sarees will undoubtedly make you stand out from the crowd. Each piece is meticulously handcrafted by skilled artisans, ensuring the highest levels of quality and attention to detail. With intricate boota designs, dazzling zari work, and exquisite borders, these sarees radiate an aura of timeless elegance. By choosing a saree from the 'Boita Bandana Pattachitra Bomkai Patta Saree' collection, you are not only owning a beautiful piece of clothing but also supporting the rich heritage and craftsmanship of Odisha. So, indulge yourself in the charm and grace of these sarees and let the world witness your impeccable sense of style and affinity towards Indian culture.",
                "symbol": "https://pre.production.artisanswizard.com/getImage?file=ProductMainImages/202401/9775268455445.webp",
                "images": [
                  "https://pre.production.artisanswizard.com/getImage?file=ProductMainImages/202401/9775268455445.webp",
                  "https://pre.production.artisanswizard.com/getImage?file=ProductGalleryImages/202401/6732329955971.webp",
                  "https://pre.production.artisanswizard.com/getImage?file=ProductGalleryImages/202401/5507947044639.webp",
                  "https://pre.production.artisanswizard.com/getImage?file=ProductGalleryImages/202401/2973327248719.webp"
                ]
              },
              "quantity": {
                "unitized": {
                  "measure": {
                    "unit": "unit",
                    "value": "1"
                  }
                },
                "available": {
                  "count": "99"
                },
                "maximum": {
                  "count": "99"
                }
              },
              "price": {
                "currency": "INR",
                "value": "1800.0",
                "maximum_value": "2000.0"
              },
              "fulfillment_id": "F1",
              "category_id": "Sarees",
              "parent_item_id": "",
              "location_id": "3",
              "time": {
                "label": "enable",
                "timestamp": "2024-09-02T21:15:19.000Z"
              },
              "@ondc/org/returnable": true,
              "@ondc/org/seller_pickup_return": true,
              "@ondc/org/return_window": "P7D",
              "@ondc/org/cancellable": true,
              "@ondc/org/time_to_ship": "P7D",
              "@ondc/org/available_on_cod": true,
              "@ondc/org/contact_details_consumer_care": "SupportExecutive,care@sabhyasha.com,09861809731",
              "@ondc/org/statutory_reqs_packaged_commodities": {
                "manufacturer_or_packer_name": "N/A",
                "manufacturer_or_packer_address": "N/A",
                "common_or_generic_name_of_commodity": "N/A",
                "month_year_of_manufacture_packing_import": "N/A"
              },
              "tags": [
                {
                  "code": "origin",
                  "list": [
                    {
                      "code": "country",
                      "value": "IND"
                    }
                  ]
                },
                {
                  "code": "attribute",
                  "list": [
                    {
                      "code": "size",
                      "value": "Free Size"
                    },
                    {
                      "code": "colour",
                      "value": "#E52B50"
                    },
                    {
                      "code": "gender",
                      "value": "female"
                    },
                    {
                      "code": "fabric",
                      "value": "cotton"
                    },
                    {
                      "code": "size_chart",
                      "value": "https://s3-ap-southeast-1.amazonaws.com/gls3storemedia/stores_live/83/2022/7192394.jpeg"
                    },
                    {
                      "code": "brand",
                      "value": "Sabhyasha"
                    },
                    {
                      "code": "colour_name",
                      "value": "amaranth"
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  }
}